
[
    {
        "date":610261200.0,
        "journal":"I had a dream I was at one of the squid’s house (he shall remain nameless but let’s say he’s a Colin and not a Goodman) petsitting for a weekend so I took off all my clothes and tore up the house just shit all over the walls and then the mom (some fake mom, not his IRL mom) came home early so I set the security alarm on the house so she couldn’t get in (faulty logic) then went outside and wrote her a $900 check for the damages and felt very very guilty about it and I was still naked. Then later I’m at a parking lot and this friend of mine Tim pulls up in a white pedo van with the roof cut out of the backend and my other friend Steph is riding in the “bed” of the pedo van and they look at me and Tim gives me that smirk which means I think he probably wanted to fuck even tho he’s 45 and celibate"
    }, {
        "date":609138000.0,
        "journal":"I wrote: Dystopia. Town center block of old castle like grey houses...like out of 1984 ... shut down (as in quarantine).. Grandma and Gina ... Grandma watching TV while I'm waiting for something in the closet... something scolded by Mom. I remember the grey large Victorian houses all settled around a town, like in Sims. The houses are very tall. I'm walking around sidewalks in this empty town. Everything saturated in grey."
    }, {
        "date":608619600.0,
        "journal":"First dreamt about a very large dog being walked around some familiar area. At some point, I was sitting on the white metal furniture outside Grammy and Grandad's house and was watching a dog (possibly this dog, possibly a different dog) and was curious if it was retarded. I then wanted to look up retarded dogs to see what they look like, as if to change the dream. Large, fluffy, angular dog. Cream, brown, and black fur, but regal and straight-postured. Then, I dreamt of going to Clean and Serene, except the room was more open-aired and it was sunny... as if the meeting hall was on the north side of the building instead of the south. All of my favorite people were there. Some people shared who I didn't know. I remember going through my Snapchat and seeing some people who shared on my snapchat. I remember looking at Tyler's snap and you could see who the person sent the snap to."
    }, {
        "date":608533200.0,
        "journal":"There was a weird, industrial-esque three-story house that me and a friend (unidentified, felt familiar) entered while being led by someone I was scared of but thought trustworthy (after the fact projected Myles onto that character). Patchy grass with chain-link fence led to a house that we travelled through multiple times. I remember dingy, dark, industrial, concrete, small staircases, etc. We were being zig-zagged through to the top of the structure. Not exactly like a scary movie but like the Blue House on Keeler at night...just eerie to be inside.Afterwards, just about teleported to dinner with several people including my dad. Somebody (maybe Dad) says that dad has cancer. I remember feeling in the dream, and being stunned that I could feel. Pain, sadness, loss, regret. It hurt me."
    }, {
        "date":608360400.0,
        "journal":"Starts out in weird room that post-fact resembles jail (not jail cell). Someone resembling Alan Martin is the proprietor and there’s a split door (like Grammy’s basement door). I think I’m in some sort of trouble. Then I go to school...feels like Olathe North but not exactly North. Lots of time goes by. There’s people hanging out outside. I park in this slanted parking lot and run into the proprietor dude again, and he looks like Alan Martin. Then dude resembling Sorrels comes up and talks to me as if he was Sorrels, except he’s blonde. Then I think I wake up."
    }, {
        "date":608187600.0,
        "journal":"At the beginning, in house resembling Grammy and Grandads. There’s a woman reminding me of Nicole F who’s there. She has this funny cat. Dark, night. Bedroom wing of house. We’re discussing something important. Lots of broody, storms outside. That’s where the driving piece comes in. It felt like hush hush rebellion. There’s discussion of a young man. I remember a room like a child’s day care play place.  I remember discussing something where maybe mom was there and I was in the red bedroom and had left my shirt keys wallet old phone in the kitchen and was quick to get in the car after everything was done. I was in PJs. At the beginning, in house resembling Grammy and Grandads. There’s a woman reminding me of Nicole F who’s there. She has this funny cat. Dark, night. Bedroom wing of house. We’re discussing something important. Lots of broody, storms outside. That’s where the driving piece comes in. It felt like hush hush rebellion. There’s discussion of a young man. I remember a room like a child’s day care play place.  I remember discussing something where maybe mom was there and I was in the red bedroom and had left my shirt keys wallet old phone in the kitchen and was quick to get in the car after everything was done. I was in PJs. "
    }, {
        "date":607842000.0,
        "journal":"Dreamt of a normal school day. Going through the ropes. Autopilot. White Cinder block hall/doorway where I suddenly realized I was out of place, like a little stunned that I had just been through a school day, class to class. Woke up shortly thereafter."
    }, {
        "date":607755600.0,
        "journal":"Very light sleep. Fell asleep around 11:30pm/12am and woke up after dream at 4am; felt very well rested.I wrote this at 4am: A bunch of SS dreams. Back to back. Running through like film. Semi consciousness. Identified levels of meta. Whether we were initiating the story in the dream or the observance of the story in the dream.was I turning the story back on by going to sleep, or turning into the story by going to sleep. **It seemed as though I was gaining some awareness that I was dreaming. Felt closer to the top of the consciousness heap.**"
    }, {
        "date":607582800.0,
        "journal":"2 consecutive acts of dream. First part is almost entirely white – three horizontally stacked rooms with little partition between them. Middle white partition is where most of the dream takes place. There's something on the floor resembling a wooden roll-out rug. White as in glowing under intense brightness of the sun. Glowing white. Second part revolves around family, specifically Grandma and Poppy. I enter the entryway of their house. That's all I remember."
    }
]
